# # print("nnn","aaa",sep='')
# #sep 是用来隔绝两个字符串  上述就是用逗号隔绝  默认是空格

# # print("nnn"*3)  #*3代表复制三次
# # print("haha"+"xixi") #加号是连接的意思
# 转义字符， \  \n 
print("什\么\时候\t发大\n财")  #\n 代表是结束符，类似回车键，后面的字符换到第二行
print(r"C:\Users\Administrator\Desktop")  #r 就是转义字符


# # a=input("请输入你的姓名:")  #输入
# # b=int(input("多大了"))  #input里面的都是字符串，所以要转义为整型
# # print(f'名字叫{a},年龄是{b+2}')   #f的作用是将字符串打印出来 格式为  f'输入你的文字{}' 中括号里面是变量，变量如果是整型，可以在里面计算

# #数据类型转换  整型 int()  浮点float()  字符串 str()   检查数字类型  type()
# #数学运算符  /除法，输出的是浮点型  //整除  只保留整数  %取余   
# # 复合运算符   a+=1 相当于 a=a+1   a+=1+2  相当于  a=a+3
# #  =是赋值，==才是等于
# # 比较运算符 
# a=3
# b=4
# # print(a!=b)  #返回true=1  flase=0
# #与或非  与：只要有个是假的就返回假  或：只有所有都为假才返回假，否则返回真
# #如果两个值都是非0非1，and的输出右边的值。or输出左边的值
# print(a or b)
