# # #列表是可变类型，list  使用中括号将一堆字符串放在一起
# # cat=['暹罗','奶牛','布偶','阿比西尼亚','暹罗']
# # print(f'我想养一只{cat[3]}')  
# # #列表操作
# # #1、切片
# # print(cat[1:3]) #需要取第二个和第三个但不包含结束序号所以要往后加
# # #2、查数据 index()
# # print(cat.index('阿比西尼亚')) #找不到就报错
# # #3、查数据出现了几次  count()
# # print(cat.count('暹罗'))
# # #4、返回列表长度  len()
# # print(len(cat)) #返回5  因为有5个字符串
# # #5增加数据
# # #5.1 append(数据)  列表结尾追加单个数据
# # cat.append("新加的")  
# # print(cat)   #此时打印出来的变量是改变的数据
# # #5.2 extend(数据) 追加多个数据 使用列表的格式
# # cat.extend(['多栋','张田中'])
# # print(cat)      
# # #5.3  insert(位置下标，数据) 在指定位置加数据，1就代表在列表中的第二个位置加数据
# # cat.insert(1,'我是第二个')
# # print(cat)

# # #6删除数据 
# # #6.1  del 变量名[字符串下标]
# cattt=['暹罗','奶牛','布偶','阿比西尼亚','暹罗']
# del cattt[1]  #删除指定字符串
# print(cattt)   
# # #6.2  pop  删除指定数据并返回该数据，告诉你删的是哪个
# # # print(cattt.pop(1))  #删除指定下标的数据，并且返回该数据
# # # print(cattt)  #返回的是已删除坐标为1的字符的列表
# # # #6.3  remove()  
# # # p=[1,5,6,9,8,4,1]
# # # p.remove(1)  #删除符合1的第一个匹配项，只会删除第一个1
# # # print(p)
# cattt=['暹罗','奶牛','布偶','阿比西尼亚','暹罗']
# cattt.remove("暹罗")
# print(cattt)

# # #7 修改数据
# # #7.1 修改指定下标的数据
# # # q=[1,5,6,9,8,4,1]
# # # q[1]="哈哈"
# # # print(q)
# # #7.2  倒序  reverse()
# mao=['暹罗','奶牛','布偶','阿比西尼亚','xx']
# mao.reverse()
# print(mao)
# # #7.3  sort()
# # # 默认升序  sort(reverse=False)  降序改为True
math=[1,5,6,5,6,9,64,7]
math.sort(reverse=False)  #True 降序  Flase  首字母要大写  
print(math)

# # #8、列表复制  copy()
# # # math2=math.copy()
# # # print(math2)

# # #9、遍历列表  使用for循环  意思就是将所有数据都访问一遍
# # math=[1,5,6,5,6,9,64,7]
# # for i in math :    #i是临时变量
# #     print(i)  
# # #10、嵌套查询 列表中如果是多层嵌套如何进行查询
jihe=[['暹罗','奶牛','布偶','阿比西尼亚','xx'],['金毛','杜宾','泰迪','比格','柯基','柴犬']]
print(jihe[0][2])  #打印第一个列表中的第三个字符

